a = int(input())
spisok = ["нуль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
spisok2 = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
for i in range(len(spisok2)):
    spisok.append(spisok2[i])

desyatki = ["двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
if a < 19:
    print (spisok[a])
elif a > 19 and a < 100:
    b = a // 10 #mmm vkusno suka
    print (desyatki[b-2], spisok[a%10])
